import json


with open('../static/json/stores.json', 'w') as f:
    store1 = {'name': 'Пятёрочка', 'address': 'Псков, Коммунальная, 68',
              'items': [['напитки', ['Coca-Cola', '120', '86'], ['Pepsi', '98', '34'], ['Ряженка', '45', '23']],
                        ['выпечка', ['Хлеб Бородино', '39', '15'], ['Ватрушка', '42', '40'],
                         ['Булка сдобная', '26', '7'], ['Багет французский', '64', '3']]]}
    store2 = {'name': 'Пятёрочка', 'address': 'Псков, Рокоссовского, 16',
              'items': [['напитки', ['Coca-Cola', '120', '86'], ['Pepsi', '98', '34'], ['Ряженка', '45', '23']],
                        ['выпечка', ['Хлеб Бородино', '39', '15'], ['Ватрушка', '42', '40'],
                         ['Булка сдобная', '26', '7'], ['Багет французский', '64', '3']]]}
    store3 = {'name': 'Пятёрочка', 'address': 'Псков, Коммунальная, 73б',
              'items': [['напитки', ['Coca-Cola', '120', '86'], ['Pepsi', '98', '34'], ['Ряженка', '45', '23']],
                        ['выпечка', ['Хлеб Бородино', '39', '15'], ['Ватрушка', '42', '40'],
                         ['Булка сдобная', '26', '7'], ['Багет французский', '64', '3']]]}
    store4 = {'name': 'Пятёрочка', 'address': 'Псков, Рижский, 87б',
              'items': [['напитки', ['Coca-Cola', '120', '86'], ['Pepsi', '98', '34'], ['Ряженка', '45', '23']],
                        ['выпечка', ['Хлеб Бородино', '39', '15'], ['Ватрушка', '42', '40'],
                         ['Булка сдобная', '26', '7'], ['Багет французский', '64', '3']]]}
    store5 = {'name': 'Пятёрочка', 'address': 'Борисовичи, Михайловская, 1',
              'items': [['напитки', ['Coca-Cola', '120', '86'], ['Pepsi', '98', '34'], ['Ряженка', '45', '23']],
                        ['выпечка', ['Хлеб Бородино', '39', '15'], ['Ватрушка', '42', '40'],
                         ['Булка сдобная', '26', '7'], ['Багет французский', '64', '3']]]}
    stores = [store1, store2, store3, store4, store5]
    json.dump(stores, f)
